<a href="https://colab.research.google.com/github/rubyspch/Colaboratory-Notes/blob/main/pandas_pivot.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

This lesson: using pivot to change how the df presents the data.

In [4]:
df= pd.DataFrame({
    "date": ["5/1/2020", "5/2/2020", "5/3/2020", "5/1/2020", "5/2/2020", "5/3/2020","5/1/2020", "5/2/2020", "5/3/2020"],
    "city": ["new york", "new york", "new york", "mumbai", "mumbai", "mumbai","beijing", "beijing","beijing" ],
    "tempurature": [65, 66, 67, 75, 74, 74, 82, 82, 80],
    "humidity": [55, 56,54, 60, 80, 75, 26, 30, 35]
})
df

       date      city  tempurature  humidity
0  5/1/2020  new york           65        55
1  5/2/2020  new york           66        56
2  5/3/2020  new york           67        54
3  5/1/2020    mumbai           75        60
4  5/2/2020    mumbai           74        80
5  5/3/2020    mumbai           74        75
6  5/1/2020   beijing           82        26
7  5/2/2020   beijing           82        30
8  5/3/2020   beijing           80        35

If you want to change around the axis and how the dataframe looks use pivot:

In [5]:
df.pivot(index="date", columns="city") #sets the indea and the columns

         tempurature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2020          82     75       65       26     60       55
5/2/2020          82     74       66       30     80       56
5/3/2020          80     74       67       35     75       54

attribute values tells df what values to show. eg just humidity:

In [6]:
df.pivot(index="date", columns="city", values="humidity")

city      beijing  mumbai  new york
date
5/1/2020       26      60        55
5/2/2020       30      80        56
5/3/2020       35      75        54

There is also pivot table: this allows you to summarize and aggregate your tabular data by creating a spreadsheet-style table...

In [7]:
df2= pd.DataFrame({
    "date": ["5/1/2020", "5/1/2020", "5/2/2020", "5/2/2020", "5/1/2020", "5/1/2020", "5/2/2020", "5/2/2020"],
    "city": ["new york", "new york", "new york", "new york", "mumbai", "mumbai", "mumbai", "mumbai"],
    "tempurature": [65, 63, 61, 58, 80, 83, 81, 85],
    "humidity": [60,59,55,59,80,80,73,85]
})
df2

       date      city  tempurature  humidity
0  5/1/2020  new york           65        60
1  5/1/2020  new york           63        59
2  5/2/2020  new york           61        55
3  5/2/2020  new york           58        59
4  5/1/2020    mumbai           80        80
5  5/1/2020    mumbai           83        80
6  5/2/2020    mumbai           81        73
7  5/2/2020    mumbai           85        85

for this df there is a morning and evening temp for both cities on 2 different days.
we want to create an average for each day:

In [9]:
df2.pivot_table(index="city", columns="date")

         humidity          tempurature
date     5/1/2020 5/2/2020    5/1/2020 5/2/2020
city
mumbai       80.0     79.0        81.5     83.0
new york     59.5     57.0        64.0     59.5

it create average by default as the aggregate function. could also do sum if you wanted...

In [10]:
df2.pivot_table(index="city", columns="date", aggfunc="sum")

         humidity          tempurature
date     5/1/2020 5/2/2020    5/1/2020 5/2/2020
city
mumbai        160      158         163      166
new york      119      114         128      119

In [11]:
df2.pivot_table(index="city", columns="date", aggfunc="count")

         humidity          tempurature
date     5/1/2020 5/2/2020    5/1/2020 5/2/2020
city
mumbai          2        2           2        2
new york        2        2           2        2

Another argument is margins. default is equal to false. It includes columns+row for the averages of values. if you make it true:

In [12]:
df2.pivot_table(index="city", columns="date", margins=True)

         humidity                  tempurature
date     5/1/2020 5/2/2020     All    5/1/2020 5/2/2020    All
city
mumbai      80.00     79.0  79.500       81.50    83.00  82.25
new york    59.50     57.0  58.250       64.00    59.50  61.75
All         69.75     68.0  68.875       72.75    71.25  72.00

Same city, diff dates.

Grouping dates using pivot_table + pd.Grouper

In [41]:
dataframe1= pd.DataFrame({
    "date": ["05/01/2020", "05/02/2020", "05/03/2020", "12/08/2020", "12/09/2020", "12/10/2020"],
    "city": ["new york", "new york", "new york", "new york", "new york", "new york"],
    "tempurature": [65, 63, 61, 20, 23,28],
    "humidity": [60,59,59,40,44,30]
})
dataframe1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         6 non-null      object
 1   city         6 non-null      object
 2   tempurature  6 non-null      int64
 3   humidity     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [42]:
#date is an object so first need to convert dates to date type
dataframe1["date"]=pd.to_datetime(dataframe1["date"])
dataframe1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         6 non-null      datetime64[ns]
 1   city         6 non-null      object
 2   tempurature  6 non-null      int64
 3   humidity     6 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 320.0+ bytes

In [45]:
#grouper groups by the frequency you specify + averages them
dataframe1.pivot_table(index=pd.Grouper(freq="M", key="date"), columns="city")

             humidity tempurature
city         new york    new york
date
2020-05-31  59.333333   63.000000
2020-12-31  38.000000   23.666667